In [100]:
import pandas as pd
import numpy as np

In [197]:
a=pd.read_excel('C:\Windows\Temp\ex1.xlsx')

In [198]:
a

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [199]:
b=pd.read_excel('C:\Windows\Temp\ex1.xlsx',header=None)

In [200]:
b

     0  1   2   3   4        5
0  NaN  a   b   c   d  message
1  0.0  1   2   3   4    hello
2  1.0  5   6   7   8    world
3  2.0  9  10  11  12      foo

In [203]:
pd.options.display.max_rows=10

In [206]:
result=pd.read_csv('‪‪C:\Windows\Temp\ex6.csv')

OSError: [Errno 22] Invalid argument: '\u202a\u202aC:\\Windows\\Temp\\ex6.csv'

In [209]:
obj="""{"name":"Wes",
"places_lives":["United States", "Spain", "Germany"],
"pet":null,
"siblings": [{"name": "Scott", "age": 30, "pets":["Zeus","Zuko"]},
            {"name": "Katie", "age": 38, "pets":["Sixes","Stache","Cisco"]}]}"""

In [210]:
import json

In [211]:
result=json.loads(obj)

In [212]:
result

{'name': 'Wes',
 'places_lives': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [213]:
asjson=json.dumps(result)

In [214]:
siblings=pd.DataFrame(result['siblings'],columns=['name','age'])

In [216]:
siblings

    name  age
0  Scott   30
1  Katie   38

In [221]:
tables = pd.read_html('https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/')

In [222]:
len(tables)

1

In [224]:
failures=tables[0]

In [225]:
failures.head()

,Bank NameBank,CityCity,StateSt,CertCert,Acquiring InstitutionAI,Closing DateClosing,FundFund
0,Almena State Bank,Almena,KS,15426,Equity Bank,"October 23, 2020",10538
1,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb","October 16, 2020",10537
2,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020",10536
3,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020",10535
4,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019",10534

In [228]:
close_timestamps=pd.to_datetime(failures['Closing DateClosing'])

In [229]:
close_timestamps

0     2020-10-23
1     2020-10-16
2     2020-04-03
3     2020-02-14
4     2019-11-01
         ...
558   2001-07-27
559   2001-05-03
560   2001-02-02
561   2000-12-14
562   2000-10-13
Name: Closing DateClosing, Length: 563, dtype: datetime64[ns]

In [230]:
from lxml import objectify

In [231]:
perf=pd.DataFrame(data)

In [232]:
perf.head()

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [235]:
from io import StringIO

In [236]:
tag='<a href="http://www.google.com">Google</a>'

In [237]:
root=objectify.parse(StringIO(tag)).getroot()

In [238]:
root

In [239]:
root.get('href')

'http://www.google.com'

In [240]:
root.text

'Google'

In [241]:
frame=pd.DataFrame({'a':np.random.randn(100)})

In [242]:
store=pd.HDFStore('mydata.h5')

In [243]:
store['obj1']=frame

In [244]:
store['obj1_col']=frame['a']

In [245]:
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [246]:
store['obj1']

           a
0   0.720124
1   1.132123
2   0.522258
3  -1.407214
4   0.531437
..       ...
95  0.948983
96  0.787482
97 -1.180748
98 -0.691515
99 -0.749365

[100 rows x 1 columns]

In [249]:
store.put('obj1', frame, format='table')

In [250]:
store.select('obj1', where=['index>=10 and index<=15'])

           a
10  1.543098
11  0.490510
12 -1.450736
13 -0.366957
14 -2.445864
15  0.748710

In [251]:
store.close()

In [253]:
frame.to_hdf('mydata.h5','obj1',format='table')

In [255]:
pd.read_hdf('mydata.h5', 'obj1',where=['index<5'])

          a
0  0.720124
1  1.132123
2  0.522258
3 -1.407214
4  0.531437

In [256]:
import requests

In [257]:
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'

In [258]:
resp=requests.get(url)

In [259]:
resp

In [260]:
data=resp.json()

In [261]:
data[0]['title']

'REF: share _mpl_repr'

In [262]:
issues=pd.DataFrame(data,columns=['number','title',
                                 'labels','state'])

In [263]:
issues

,number,title,labels,state
0,41627,REF: share _mpl_repr,"[{'id': 1218227310, 'node_id': 'MDU6TGFiZWwxMj...",open
1,41626,API: make CategoricalIndex._concat consistent ...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
2,41625,"QST: read_excel - ""odf engine"" remove ""\n"" whe...","[{'id': 1954720290, 'node_id': 'MDU6TGFiZWwxOT...",open
3,41624,REF: simplify maybe_cast_to_datetime,"[{'id': 127681, 'node_id': 'MDU6TGFiZWwxMjc2OD...",open
4,41623,QST: Error in Pandas to_datetime conversion?,"[{'id': 1954720290, 'node_id': 'MDU6TGFiZWwxOT...",open
...,...,...,...,...
25,41590,[ArrowStringArray] PERF: use pyarrow.compute.r...,"[{'id': 8935311, 'node_id': 'MDU6TGFiZWw4OTM1M...",open
26,41589,ENH: Deprecate non-keyword arguments for Multi...,"[{'id': 87485152, 'node_id': 'MDU6TGFiZWw4NzQ4...",open
27,41588,TYP: IntervalIndex.right/left might be infered...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
28,41586,DEPR: Timestamp.freq,"[{'id': 87485152, 'node_id': 'MDU6TGFiZWw4NzQ4...",open
29,41585,BUG: concatenation on monthstart indexes in wr...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open

In [264]:
import sqlite3
query="""
CREATE TABLE test
(a VARCHAR(20), b VARCHAR(20),
c REAL,         d INTEGER);"""

In [266]:
con=sqlite3.connect('mydata.sqlite')

In [267]:
con.execute(query)

In [268]:
con.commit()

In [269]:
data=[('A','B',1.25,6),
     ('C','D',2.6,3),
     ('E','F',1.7,5)]

In [270]:
stmt="INSERT INTO test VALUES(?,?,?,?)"

In [271]:
con.executemany(stmt,data)

In [272]:
con.commit()

In [278]:
cursor=con.execute('select*from test')

In [279]:
rows=cursor.fetchall()

In [280]:
rows

[('A', 'B', 1.25, 6), ('C', 'D', 2.6, 3), ('E', 'F', 1.7, 5)]

In [281]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [282]:
import sqlalchemy as sqla

In [283]:
db= sqla.create_engine('sqlite:///mydata.sqlite')

In [285]:
pd.read_sql('select*from test', db)

   a  b     c  d
0  A  B  1.25  6
1  C  D  2.60  3
2  E  F  1.70  5

In [56]:
string_data=pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [57]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [58]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [59]:
string_data[0]=None

In [60]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [61]:
from numpy import nan as NA

In [62]:
data=pd.Series([1,NA,3.5,NA,7])

In [63]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [64]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [65]:
df=pd.DataFrame(np.random.randn(7,3))

In [66]:
df.iloc[:4,1]=NA

In [67]:
df

          0         1         2
0 -0.090800       NaN  0.466308
1 -0.620069       NaN  1.680956
2 -1.810642       NaN -0.360294
3  2.137562       NaN  0.558938
4  1.368082 -0.543337  1.533154
5  0.494154  1.599307  1.657294
6  0.364360  3.343503 -1.652361

In [68]:
df.dropna()

          0         1         2
4  1.368082 -0.543337  1.533154
5  0.494154  1.599307  1.657294
6  0.364360  3.343503 -1.652361

In [69]:
df.dropna(thresh=2)

          0         1         2
0 -0.090800       NaN  0.466308
1 -0.620069       NaN  1.680956
2 -1.810642       NaN -0.360294
3  2.137562       NaN  0.558938
4  1.368082 -0.543337  1.533154
5  0.494154  1.599307  1.657294
6  0.364360  3.343503 -1.652361

In [70]:
ages=[20,22,25,27,21,23,37,31,61,45,41,32]

In [71]:
bins=[18,25,35,60,100]

In [72]:
cats=pd.cut(ages,bins)

In [73]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [74]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [75]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [76]:
data=pd.DataFrame(np.random.randn(1000,4))

In [77]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.063400    -0.010849    -0.013548     0.001190
std       0.980065     0.952913     1.015602     1.003661
min      -3.504993    -3.291357    -2.780094    -3.214590
25%      -0.562471    -0.641333    -0.756172    -0.711739
50%       0.046832    -0.007070    -0.006207     0.017286
75%       0.733648     0.625818     0.658496     0.635931
max       3.368457     2.902777     3.325852     3.213975

In [78]:
col=data[2]

In [79]:
col[np.abs(col)>3]

7    3.325852
Name: 2, dtype: float64

In [80]:
data[(np.abs(data)>3).any(1)]

            0         1         2         3
7   -0.249994 -0.117411  3.325852 -1.985657
26  -3.504993  0.096260 -0.035384  1.009117
218  0.085243  0.739989  0.928911 -3.214590
241  1.354636  0.913164  1.240572  3.140825
326  0.704436  1.320202  0.293419  3.213975
369  0.640447 -3.291357 -1.599444 -1.056728
814  3.368457 -0.945340 -0.076935  1.345110
865 -3.379251  0.045162  0.377889 -0.667323
963 -3.267364 -0.039667  1.229913 -2.343603

In [81]:
val='a,b,guido'

In [82]:
val.split('.')

['a,b,guido']

In [83]:
val.inex(':')

AttributeError: 'str' object has no attribute 'inex'

In [84]:
val.find(':')

-1

In [85]:
val.count('.')

0

In [86]:
import re

In [87]:
text='foo bar\t baz \tqux'

In [88]:
re.split('\s+',text)

['foo', 'bar', 'baz', 'qux']

In [89]:
regex=re.compile('\s+')

In [90]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [116]:
data=pd.Series(np.random.randn(9),
              index=[['a','a','a','b','b','c','c','d','d'],
                    [1,2,3,1,3,1,2,2,3]])

In [117]:
data

a  1   -0.289219
   2    0.433077
   3   -0.496620
b  1   -0.536040
   3    0.200159
c  1    0.082466
   2    1.473348
d  2   -0.936201
   3    0.207860
dtype: float64

In [118]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [135]:
df1=pd.DataFrame({'key':['b','b','a','c','a','a','b'],
                 'data1':range(7)})

In [136]:
df2=pd.DataFrame({'key':['a','b','d'],
                 'data2':range(3)})

In [137]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [138]:
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [139]:
pd.merge(df1,df2)

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [140]:
left1=pd.DataFrame({'key':['a','b','a','a','b','c'],
                 'value':range(6)})

In [143]:
right1=pd.DataFrame({'group_val':[3.4,7],'index':['a','b']})

In [144]:
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [145]:
right1

   group_val index
0        3.4     a
1        7.0     b

In [146]:
arr=np.arange(12).reshape((3,4))

In [147]:
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [148]:
np.concatenate([arr,arr],axis=1)

array([[ 0,  1,  2,  3,  0,  1,  2,  3],
       [ 4,  5,  6,  7,  4,  5,  6,  7],
       [ 8,  9, 10, 11,  8,  9, 10, 11]])

In [156]:
s1=pd.Series([0,1],index=['a','b'])
s2=pd.Series([2,3,4],index=['c','d','e'])
s3=pd.Series([5,6],index=['f','g'])

In [157]:
pd.concat([s1,s2,s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [158]:
pd.concat([s1,s2,s3],axis=1)

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [162]:
data = pd.DataFrame(np.arange(6).reshape((2, 3)),
                    index=pd.Index(['Ohio', 'Colorado'], name='state'),
                    columns=pd.Index(['one', 'two', 'three'], name='number'))

In [163]:
data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [164]:
result=data.stack()

In [165]:
result

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int32

In [166]:
result.unstack()

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [167]:
result.unstack(0)

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [169]:
df=pd.DataFrame({'key':['foo','bar','baz'],
                  'A':[1,2,3],
                  'B':[4,5,6],
                  'C':[7,8,9]})

In [170]:
df

   key  A  B  C
0  foo  1  4  7
1  bar  2  5  8
2  baz  3  6  9

In [171]:
melted=pd.melt(df,['key'])

In [172]:
melted

   key variable  value
0  foo        A      1
1  bar        A      2
2  baz        A      3
3  foo        B      4
4  bar        B      5
5  baz        B      6
6  foo        C      7
7  bar        C      8
8  baz        C      9

In [173]:
reshaped=melted.pivot('key','variable','value')

In [174]:
reshaped

variable  A  B  C
key
bar       2  5  8
baz       3  6  9
foo       1  4  7

In [175]:
reshaped.reset_index()

variable  key  A  B  C
0         bar  2  5  8
1         baz  3  6  9
2         foo  1  4  7

In [176]:
pd.melt(df, id_vars=['key'], value_vars=['A','B'])

   key variable  value
0  foo        A      1
1  bar        A      2
2  baz        A      3
3  foo        B      4
4  bar        B      5
5  baz        B      6

In [177]:
pd.melt(df, value_vars=['A','B','C'])

  variable  value
0        A      1
1        A      2
2        A      3
3        B      4
4        B      5
5        B      6
6        C      7
7        C      8
8        C      9

In [178]:
df

   key  A  B  C
0  foo  1  4  7
1  bar  2  5  8
2  baz  3  6  9

In [179]:
pd.melt(df, value_vars=['key','A','B'])

  variable value
0      key   foo
1      key   bar
2      key   baz
3        A     1
4        A     2
5        A     3
6        B     4
7        B     5
8        B     6